# Pandas

In [1]:
import pandas as pd

Pandas provides 2 classes for handling data:
1. Series (one-dim labeled array)
2. DataFrame (2-dim data structure)

# 1. Object Creation

In [33]:
import numpy as np

# Series: creating seris by passing list of vals
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

# DF: create by passing a dictionary of objects where the keys are the column labels and the values are the column values
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
print(df)

# DF: create by passing a numpy array 
dates = pd.date_range("20130101", periods=6) # ex: using a datetime index (default is int64)
df2 = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
print(df2)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo
                   A         B         C         D
2013-01-01  1.828546 -1.414360 -0.404328 -1.616925
2013-01-02 -0.206377  0.740711 -0.161401  0.671150
2013-01-03 -0.227417  3.067486  2.279030  0.006653
2013-01-04  0.147085  0.331784 -0.673559  0.058463
2013-01-05 -0.541953  0.248727  0.243178  1.117590
2013-01-06 -1.013002 -1.096215  0.032966 -1.553605

# 2. Viewing data

In [22]:
df.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [23]:
df.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [25]:
# display the index
df2.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
# display the columns
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [28]:
# get column types
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [31]:
# quick summary stats
df.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

# 3. Pandas DFs vs. Numpy Arrays

**Note: NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column.**

When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

In [30]:
# numpy representation (without the index or column labels)
df2.to_numpy()

array([[ 0.01046211,  0.44805268, -0.27094003,  0.67674704],
       [ 0.64262982,  0.07184077,  1.07278554,  0.01512464],
       [-0.62868908,  0.57417753, -0.76544111, -0.96673048],
       [ 0.22410353, -0.01574899, -1.69028531, -2.07245943],
       [-0.46098192,  0.08229809, -0.44798499, -0.05982338],
       [ 1.09768682,  2.6231044 ,  1.27481888, -0.17836873]])

# 4. Data manipulation

In [35]:
# transposing data
df2.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.828546   -0.206377   -0.227417    0.147085   -0.541953   -1.013002
B   -1.414360    0.740711    3.067486    0.331784    0.248727   -1.096215
C   -0.404328   -0.161401    2.279030   -0.673559    0.243178    0.032966
D   -1.616925    0.671150    0.006653    0.058463    1.117590   -1.553605

In [36]:
# sort by an axis
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.616925 -0.404328 -1.414360  1.828546
2013-01-02  0.671150 -0.161401  0.740711 -0.206377
2013-01-03  0.006653  2.279030  3.067486 -0.227417
2013-01-04  0.058463 -0.673559  0.331784  0.147085
2013-01-05  1.117590  0.243178  0.248727 -0.541953
2013-01-06 -1.553605  0.032966 -1.096215 -1.013002

In [38]:
# sorting rows by column values
df2.sort_values(by="B") # (ascending)

                   A         B         C         D
2013-01-01  1.828546 -1.414360 -0.404328 -1.616925
2013-01-06 -1.013002 -1.096215  0.032966 -1.553605
2013-01-05 -0.541953  0.248727  0.243178  1.117590
2013-01-04  0.147085  0.331784 -0.673559  0.058463
2013-01-02 -0.206377  0.740711 -0.161401  0.671150
2013-01-03 -0.227417  3.067486  2.279030  0.006653

# 5. Selecting Items from Dfs
Note: for label slicing, both endpoints are included

In [41]:
df2["A"] # output: a series, passing single label = series of col A

2013-01-01    1.828546
2013-01-02   -0.206377
2013-01-03   -0.227417
2013-01-04    0.147085
2013-01-05   -0.541953
2013-01-06   -1.013002
Freq: D, Name: A, dtype: float64

In [42]:
# selecting by row/passing slices (selects matching rows)
df2[0:3]
df2["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.206377  0.740711 -0.161401  0.671150
2013-01-03 -0.227417  3.067486  2.279030  0.006653
2013-01-04  0.147085  0.331784 -0.673559  0.058463

In [45]:
# selection by column/label
print(df2.loc[dates[0]]) # output: a row (dates is the index we defined earlier)

# selecting all rows in selected columns
print(df2.loc[:, ["A", "B"]])

A    1.828546
B   -1.414360
C   -0.404328
D   -1.616925
Name: 2013-01-01 00:00:00, dtype: float64
                   A         B
2013-01-01  1.828546 -1.414360
2013-01-02 -0.206377  0.740711
2013-01-03 -0.227417  3.067486
2013-01-04  0.147085  0.331784
2013-01-05 -0.541953  0.248727
2013-01-06 -1.013002 -1.096215

In [48]:
# selecting by row and col
df2.loc["20130102":"20130104", ["A", "B"]] # output: a df

df2.loc[dates[0], "A"] # output: a scalar

1.8285460914417306

In [52]:
# Selecting by position

# select via the position of passed integers
print(df2.iloc[3])

# select via integer slices
print(df2.iloc[3:5, 0:2])

# select via list of integer positions
print(df2.iloc[[1, 2, 4], [0, 2]])

# for getting explicit value
print(df2.iloc[1, 1])
print(df2.iat[1, 1]) # faster

A    0.147085
B    0.331784
C   -0.673559
D    0.058463
Name: 2013-01-04 00:00:00, dtype: float64
                   A         B
2013-01-04  0.147085  0.331784
2013-01-05 -0.541953  0.248727
                   A         C
2013-01-02 -0.206377 -0.161401
2013-01-03 -0.227417  2.279030
2013-01-05 -0.541953  0.243178
0.7407105967643838
0.7407105967643838

In [56]:
# Boolean indexing

# Select rows where df.A is greater than 0
df2[df2["A"] > 0]

# select values from df where boolean condition met
df2[df2 > 0]

# filtering via isin()
df3 = df2.copy()
df3["E"] = ["one", "one", "two", "three", "four", "three"]
df3[df3["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.227417  3.067486  2.279030  0.006653   two
2013-01-05 -0.541953  0.248727  0.243178  1.117590  four

# 6. Setting new cols

In [62]:
# Setting a new column (automatically aligns the data by the indexes)
print("before:",df2)
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
df2["F"] = s1
df2

# setting a value by label/col
df2.at[dates[0], "A"] = 0

# setting vals by position
df2.iat[0,1] = 0

# setting by assigning with numpy array
df2.loc[:, "D"] = np.array([5] * len(df2))

print("after:", df2)

before:                    A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.404328  5.0  NaN
2013-01-02 -0.206377  0.740711 -0.161401  5.0  1.0
2013-01-03 -0.227417  3.067486  2.279030  5.0  2.0
2013-01-04  0.147085  0.331784 -0.673559  5.0  3.0
2013-01-05 -0.541953  0.248727  0.243178  5.0  4.0
2013-01-06 -1.013002 -1.096215  0.032966  5.0  5.0
after:                    A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.404328  5.0  NaN
2013-01-02 -0.206377  0.740711 -0.161401  5.0  1.0
2013-01-03 -0.227417  3.067486  2.279030  5.0  2.0
2013-01-04  0.147085  0.331784 -0.673559  5.0  3.0
2013-01-05 -0.541953  0.248727  0.243178  5.0  4.0
2013-01-06 -1.013002 -1.096215  0.032966  5.0  5.0

In [63]:
# where operations with setting values
df3 = df2.copy()
df3[df3 > 0] = -df3
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.404328 -5.0  NaN
2013-01-02 -0.206377 -0.740711 -0.161401 -5.0 -1.0
2013-01-03 -0.227417 -3.067486 -2.279030 -5.0 -2.0
2013-01-04 -0.147085 -0.331784 -0.673559 -5.0 -3.0
2013-01-05 -0.541953 -0.248727 -0.243178 -5.0 -4.0
2013-01-06 -1.013002 -1.096215 -0.032966 -5.0 -5.0

# 7. Missing Data

In [65]:
# Reindexing allows you to change/add/delete the index on a specified axis
df3 = df2.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df3.loc[dates[0] : dates[1], "E"] = 1
df3

                   A         B         C    D    E    F    E
2013-01-01  0.000000  0.000000 -0.404328  5.0  1.0  NaN  1.0
2013-01-02 -0.206377  0.740711 -0.161401  5.0  1.0  1.0  1.0
2013-01-03 -0.227417  3.067486  2.279030  5.0  NaN  2.0  NaN
2013-01-04  0.147085  0.331784 -0.673559  5.0  NaN  3.0  NaN

In [66]:
df3.dropna(how="any")

                   A         B         C    D    E    F    E
2013-01-02 -0.206377  0.740711 -0.161401  5.0  1.0  1.0  1.0

In [67]:
df3.fillna(value=5)

                   A         B         C    D    E    F    E
2013-01-01  0.000000  0.000000 -0.404328  5.0  1.0  5.0  1.0
2013-01-02 -0.206377  0.740711 -0.161401  5.0  1.0  1.0  1.0
2013-01-03 -0.227417  3.067486  2.279030  5.0  5.0  2.0  5.0
2013-01-04  0.147085  0.331784 -0.673559  5.0  5.0  3.0  5.0

In [68]:
pd.isna(df3)

                A      B      C      D      E      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False   True  False   True
2013-01-04  False  False  False  False   True  False   True

# 8. Binary Operations
With binary operations between pandas data structures, there are two key points of interest:
* Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.
* Missing data in computations.

In [70]:
# Matching/broadcasting behavior

df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)

df

row = df.iloc[1] 

column = df["two"]

df.sub(row, axis="columns") 

df.sub(row, axis=1) 

df.sub(column, axis="index")

df.sub(column, axis=0)

# align a level of a multi-indexed df with a series
dfmi = df.copy()

dfmi.index = pd.MultiIndex.from_tuples(
    [(1, "a"), (1, "b"), (1, "c"), (2, "a")], names=["first", "second"]
)

dfmi.sub(column, axis=0, level="second")

                   one       two     three
first second
1     a      -0.954801  0.000000       NaN
      b       2.034730  0.000000  1.454910
      c      -0.937765  0.000000  0.666650
2     a            NaN -2.746297 -1.406818

In [72]:
# floor division and modulo ops (work on series and on indexs)

# series
s = pd.Series(np.arange(10))
print(s)

div, rem = divmod(s, 3)
print(div)

print(rem)

# indexes
idx = pd.Index(np.arange(10))
div, rem = divmod(idx, 3)
print(div)
print(rem)

# element-wise divmod
div, rem = divmod(s, [2, 2, 3, 3, 4, 4, 5, 5, 6, 6])
print(div)
print(rem)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
9    3
dtype: int64
0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    0
dtype: int64
Index([0, 0, 0, 1, 1, 1, 2, 2, 2, 3], dtype='int64')
Index([0, 1, 2, 0, 1, 2, 0, 1, 2, 0], dtype='int64')
0    0
1    0
2    0
3    1
4    1
5    1
6    1
7    1
8    1
9    1
dtype: int64
0    0
1    1
2    2
3    0
4    0
5    1
6    1
7    2
8    2
9    3
dtype: int64

In [73]:
# missing data ops

df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
print(df)

df2 = df.copy()
df2.loc["a", "three"] = 1.0
print(df2)

print(df + df2)

print(df.add(df2, fill_value=0))

        one       two     three
a -1.323881 -0.925435       NaN
b  1.959683 -0.773692  0.932363
c -0.226042  0.718586 -0.238475
d       NaN  2.244084  0.845297
        one       two     three
a -1.323881 -0.925435  1.000000
b  1.959683 -0.773692  0.932363
c -0.226042  0.718586 -0.238475
d       NaN  2.244084  0.845297
        one       two     three
a -2.647762 -1.850869       NaN
b  3.919365 -1.547383  1.864725
c -0.452084  1.437173 -0.476949
d       NaN  4.488168  1.690595
        one       two     three
a -2.647762 -1.850869  1.000000
b  3.919365 -1.547383  1.864725
c -0.452084  1.437173 -0.476949
d       NaN  4.488168  1.690595

Series and DataFrame have the binary comparison methods eq, ne, lt, gt, le, and ge whose behavior is analogous to the binary arithmetic operations described above. 

These operations produce a pandas object of the same type as the left-hand-side input that is of dtype bool. These boolean objects can be used in indexing operations

In [74]:
df.gt(df2) # greater than
df2.ne(df)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [75]:
# Boolean reductions
# You can apply the reductions: empty, any(), all(), and bool() to provide a way to summarize a boolean result
(df > 0).all()
(df > 0).any()
(df > 0).any().any()

df.empty # checking if pandas object is empty
pd.DataFrame(columns=list("ABC")).empty

(df + df).equals(df * 2) # checking if two pandas objects equivalent (without any nan issues)

True

# 8. Stats

In [76]:
df.mean() # returns mean per col

df.mean(axis=1) # returns mean for each row

one      0.136587
two      0.315886
three    0.513062
dtype: float64

User defined functions

In [77]:
df.agg(lambda x: np.mean(x) * 5.6)

one      0.764885
two      1.768962
three    2.873146
dtype: float64

In [78]:
df.transform(lambda x: x * 101.2)

          one         two      three
a -133.976740  -93.653984        NaN
b  198.319893  -78.297591  94.355091
c  -22.875441   72.720953 -24.133631
d         NaN  227.101277  85.544094

In [79]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)
s.value_counts()

0    1
1    4
2    5
3    5
4    3
5    4
6    2
7    3
8    6
9    1
dtype: int64

1    2
4    2
5    2
3    2
2    1
6    1
Name: count, dtype: int64

String methods

In [81]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
print(s)
s.str.lower()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 9. Merging

In [82]:
# concat
df = pd.DataFrame(np.random.randn(10, 4))
print(df)
pieces = [df[:3], df[3:7], df[7:]]
print(pieces)
pd.concat(pieces)

          0         1         2         3
0  2.398761  1.153028  0.493554  0.127580
1 -0.526208 -1.010962  0.019030  0.535395
2  0.200172  0.575875 -0.843528 -0.335269
3  0.380716  0.483293 -0.137698 -1.509797
4  0.126737  0.282816  0.358572 -0.561731
5  0.347211 -0.003997 -0.237865 -1.374357
6  1.232928 -1.236890 -1.075714  0.284356
7 -0.739513 -2.265445 -0.119986  1.337753
8 -0.533209  1.145994  0.858943  0.445189
9  0.545111  0.352741 -2.096215 -0.208172
[          0         1         2         3
0  2.398761  1.153028  0.493554  0.127580
1 -0.526208 -1.010962  0.019030  0.535395
2  0.200172  0.575875 -0.843528 -0.335269,           0         1         2         3
3  0.380716  0.483293 -0.137698 -1.509797
4  0.126737  0.282816  0.358572 -0.561731
5  0.347211 -0.003997 -0.237865 -1.374357
6  1.232928 -1.236890 -1.075714  0.284356,           0         1         2         3
7 -0.739513 -2.265445 -0.119986  1.337753
8 -0.533209  1.145994  0.858943  0.445189
9  0.545111  0.352741 -2.096215 -0.208172]

          0         1         2         3
0  2.398761  1.153028  0.493554  0.127580
1 -0.526208 -1.010962  0.019030  0.535395
2  0.200172  0.575875 -0.843528 -0.335269
3  0.380716  0.483293 -0.137698 -1.509797
4  0.126737  0.282816  0.358572 -0.561731
5  0.347211 -0.003997 -0.237865 -1.374357
6  1.232928 -1.236890 -1.075714  0.284356
7 -0.739513 -2.265445 -0.119986  1.337753
8 -0.533209  1.145994  0.858943  0.445189
9  0.545111  0.352741 -2.096215 -0.208172

In [85]:
# merge
# SQL type joins across specific columns
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
print(pd.merge(left, right, on="key"))

# on unique keys
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
print(pd.merge(left, right, on="key"))

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5
   key  lval  rval
0  foo     1     4
1  bar     2     5

# 10. Grouping

In [86]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.121850 -1.925948
1  bar    one  0.121831  1.177934
2  foo    two  3.335747  1.020076
3  bar  three -0.252429  0.631471
4  foo    two -0.023693  0.219754
5  bar    two  1.295401 -0.260843
6  foo    one -0.606688  0.166976
7  foo  three -0.356057 -0.621251

In [87]:
# group by col label, then summing
print(df.groupby("A")[["C", "D"]].sum())

print(df.groupby(["A", "B"]).sum()) # Grouping by multiple columns label forms MultiIndex

            C         D
A
bar  1.164802  1.548561
foo  2.227459 -1.140394
                  C         D
A   B
bar one    0.121831  1.177934
    three -0.252429  0.631471
    two    1.295401 -0.260843
foo one   -0.728538 -1.758972
    three -0.356057 -0.621251
    two    3.312054  1.239830

# 10. Time Series

In [88]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum() # resampling for frequency conversions


rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)

ts_utc = ts.tz_localize("UTC") # localize to a time zone 

ts_utc.tz_convert("US/Eastern") # convert to a diff time zone

# adding a non-fixed duration like buisness day to a time series
rng + pd.offsets.BusinessDay(5)

2012-01-01    23829
Freq: 5min, dtype: int64

In [ ]:
# 11. Categoricals

In [ ]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

# rename categories to more meaningful name
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories)

# reorder and add missing categories 
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)

# sorting is per order in categories, not lexical order
df.sort_values(by="grade")
df.groupby("grade", observed=False).size()